app/views/public/events/index.html.erb

SELECT "events".* FROM "events"
---
          <% @tags.each do |tag| %>
            <% if tag.events.count != 0 %>

SELECT COUNT(*) FROM "comments" WHERE "comments"."event_id" = ?  [["event_id", 1]]
---

            <p>コメント<%= event.comments.count %>件</p>