app/views/public/events/show.html.erb

      <div class="comments">
      <p>コメント件数：<%= @event.comments.count %></p>
      <% @event.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = ?  [["event_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."event_id" = ?  [["event_id", 1]]