app/views/public/recruit_users/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
          <p class="orchestra-item"><span class = "gray">メイン楽器：</span>
          <%= (Instrument.find_by(id: recruit_user.user.instrument_id)).instrument_name %></p>

SELECT "user_rooms"."id" FROM "user_rooms" WHERE "user_rooms"."user_id" != ?  [["user_id", 3]]
---
                <div class="sel sel--black-panther">
                  <%= f.collection_select :room_id, @users_room.where.not(id: UserRoom.where(user_id: recruit_user.user_id ).pluck(:room_id)) , :id, :room_name, include_blank: "選択して下さい" %>