app/controllers/admin/orchestras_controller.rb

SELECT "orchestras".* FROM "orchestras"
SELECT "orchestras"."user_id" FROM "orchestras"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @orchestras = Orchestra.all
    application_user = Orchestra.pluck(:user_id)
    @sum = User.where(id: application_user, role: "general")