app/controllers/public/comments_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("event_id", "user_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["event_id", 1], ["user_id", 1], ["comment", "zzz"], ["created_at", "2021-06-03 15:14:27.856793"], ["updated_at", "2021-06-03 15:14:27.856793"]]
---
  def create

    event = Event.find(params[:event_id])
    comment = Comment.new(comment_params)

    if comment.save