app/controllers/public/events_controller.rb

  def update
    @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @event = Event.new(event_params)
    tag_list = params[:event][:tag_name].split(/[[:blank:]]+/)
    if @event.save
---
INSERT INTO "events" ("area_id", "title", "event_introduction", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["area_id", 4], ["title", "あああ"], ["event_introduction", "っs"], ["created_at", "2021-06-02 06:37:49.367981"], ["updated_at", "2021-06-02 06:37:49.367981"]]