app/controllers/public/events_controller.rb

  def index
    @search_past = params[:search_past]

    if  @search_past == "開催予定のイベント"
      @event_search = Event.where("events.end > ?", DateTime.now).reorder(:end)
    elsif @search_past == "過去のイベント"
      @event_search = Event.where("events.end < ?", DateTime.now).reorder(:end)
    else
      @event_search = Event.all
---
SELECT "events".* FROM "events"