app/controllers/public/recruitments_controller.rb

SELECT  "recruitments".* FROM "recruitments" WHERE "recruitments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "recruit_users".* FROM "recruit_users" WHERE "recruit_users"."recruitment_id" = ? AND "recruit_users"."user_id" = ? LIMIT ?  [["recruitment_id", 1], ["user_id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "recruit_users" WHERE "recruit_users"."recruitment_id" = ? AND "recruit_users"."join" = ?  [["recruitment_id", 2], ["join", 0]]
SELECT "recruit_users".* FROM "recruit_users" WHERE "recruit_users"."recruitment_id" = ?  [["recruitment_id", 1]]
---
  def show
    @recruitment = Recruitment.find(params[:id])
    @recruit_users = RecruitUser.all
    @recruit_user = RecruitUser.where(recruitment_id: @recruitment.id )
    @count = RecruitUser.where(recruitment_id: @recruitment.id , join: false).count
    @recruitment_user = RecruitUser.find_by(recruitment_id: @recruitment.id, user_id: current_user.id)

SELECT  "recruitments".* FROM "recruitments" WHERE "recruitments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
     @recruitment = Recruitment.find(params[:id])

SELECT  "recruitments".* FROM "recruitments" WHERE "recruitments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "recruitments" SET "recruit_introduction" = ?, "updated_at" = ? WHERE "recruitments"."id" = ?  [["recruit_introduction", "初めての演奏会ですyo。"], ["updated_at", "2021-06-02 03:17:05.732349"], ["id", 1]]
---
  def update
    @recruitment = Recruitment.find(params[:id])
    if @recruitment.update(recruitment_params)

INSERT INTO "recruitments" ("area_id", "title", "recruit_introduction", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["area_id", 6], ["title", "aaa"], ["recruit_introduction", "sss"], ["created_at", "2021-06-02 04:15:38.683812"], ["updated_at", "2021-06-02 04:15:38.683812"]]
---
  def create
     @recruitment = Recruitment.new(recruitment_params)
     a = (with_event_params)
     puts "aaaaaaaaaaaaaaaaaaaaaaaa"
     p a
     event = Event.new
    if @recruitment.save

SELECT  "recruitments".* FROM "recruitments" WHERE "recruitments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "recruitments" WHERE "recruitments"."id" = ?  [["id", 1]]
---
  def destroy
    @recruitment = Recruitment.find(params[:id])
    @recruitment.destroy

SELECT  "recruitments".* FROM "recruitments" WHERE "recruitments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def confirm
    @recruitment = Recruitment.find(params[:id])