app/controllers/public/recruit_users_controller.rb

SELECT  "recruitments".* FROM "recruitments" WHERE "recruitments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "recruit_users" ("user_id", "recruitment_id", "recruit_comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["recruitment_id", 2], ["recruit_comment", "ddd"], ["created_at", "2021-06-04 06:41:46.957625"], ["updated_at", "2021-06-04 06:41:46.957625"]]
---
  def create
    recruit_user = RecruitUser.new(recruit_user_params)
    recruitment = recruit_user.recruitment_id
    recruit_user.user_id = current_user.id

    # 申請通知用
    recruit = Recruitment.find_by(id: recruitment)
    recruitment_user = recruit.user_id
    user = User.find_by(id: recruitment_user)
    if recruit_user.save

SELECT "recruit_users".* FROM "recruit_users"
SELECT "user_rooms"."id" FROM "user_rooms" WHERE "user_rooms"."user_id" != ?  [["user_id", 3]]
---
  def index
    @recruit_users = RecruitUser.all
    @recruitment = params[:recruitment].to_i
    @user_room = UserRoom.new
    @user_rooms = UserRoom.all

SELECT  "recruit_users".* FROM "recruit_users" WHERE "recruit_users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "recruit_users" WHERE "recruit_users"."id" = ?  [["id", 16]]
---
  def destroy
    @recruit_user = RecruitUser.find(params[:id])
    @recruit_user.destroy

SELECT  "recruit_users".* FROM "recruit_users" WHERE "recruit_users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "recruit_users" SET "join" = ?, "recruit_comment" = ?, "updated_at" = ? WHERE "recruit_users"."id" = ?  [["join", 1], ["recruit_comment", ""], ["updated_at", "2021-06-04 13:37:22.624308"], ["id", 4]]
---
  def update
    @recruit = RecruitUser.find(params[:id])
    if @recruit_user = @recruit.update(recruit_user_params)