app/controllers/public/recruitments_controller.rb

SELECT "recruitments".* FROM "recruitments"
---
  def index
    # @recruitments = Recruitment.where("recruitments.recruit_end > ?", DateTime.now).reorder(:recruit_end)
    @search = params[:search]
    @word = params[:word]
    @recruit_params = [params[:word],params[:area],params[:end_gteq],params[:start_lteq]]
    @search_past = params[:search_past]

    if  @search_past == "開催予定のイベント"
      @recruit = Recruitment.where("recruitments.recruit_end > ?", DateTime.now).reorder(:end)
    elsif @search_past == "過去のイベント"
      @recruit = Recruitment.where("recruitments.recruit_end < ?", DateTime.now).reorder(:end)
    else
      @recruit = Recruitment.all