app/controllers/public/rooms_controller.rb

  def show
    @room = Room.find(params[:id])
    # @direct_messages = @room.chats
    # puts 121212121
    # p @direct_messages
    @chats = @room.chats.includes(:user)
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @room = Room.new(room_params)
    @user_room = UserRoom.new
    if @room.save!
---
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["room_id", 1], ["created_at", "2021-06-04 14:42:33.523805"], ["updated_at", "2021-06-04 14:42:33.523805"]]