app/controllers/public/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "recruitments".* FROM "recruitments"
---
  def show
    @user = User.find(params[:id])
    @recruitments = Recruitment.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "sss"], ["updated_at", "2021-06-05 13:32:21.693497"], ["id", 1]]
---
  def update
    # @user = current_user
    @user = User.find(params[:id])
    if @user.update(user_params)