app/views/public/recruitments/edit.html.erb

SELECT "instruments".* FROM "instruments"
---

    <%= f.collection_select :instrument_id, Instrument.all, :id, :instrument_name, prompt: "----", required: "required",  placeholder: " "%>

SELECT "areas".* FROM "areas"
---
          <span class=" sel">
            <%= f.collection_select :area_id, Area.all, :id, :area_name, prompt: "----", required: "required", placeholder: " "%>