app/views/public/recruitments/new.html.erb

SELECT "areas".* FROM "areas"
---
    <%= f.label :area_id, 'エリア' %>
  <%= f.collection_select :area_id, Area.all, :id, :area_name, prompt: "----", required: "required", class: 'page-title', placeholder: " "%>