app/views/public/users/edit.html.erb

  <%= f.label :area_id, 'エリア' %>
  <%= f.collection_select :area_id, Area.all, :id, :area_name, prompt: "----", required: "required", class: 'page-title', placeholder: " "%>
---
SELECT "areas".* FROM "areas"

  <%= f.label :instrument_id, 'メイン楽器' %>
  <%= f.collection_select :instrument_id, Instrument.all, :id, :instrument_name, prompt: "----", required: "required", class: 'page-title' %>
---
SELECT "instruments".* FROM "instruments"