app/views/public/users/show.html.erb

SELECT  "recruitments".* FROM "recruitments" WHERE "recruitments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
      <% @recruit_users.each do |recruit_user| %>
        <% Recruitment.where(id: recruit_user.recruitment_id).each do |recruit| %>